# CreateDefaultRebarBarType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..CreateDefaultRebarBarType Method
RebarBarType Class See Also
---
Creates a new RebarBarType object with a default name.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static ElementId CreateDefaultRebarBarType(
	Document ADoc
)
```

Visual Basic
---
```text
Public Shared Function CreateDefaultRebarBarType ( _
	ADoc As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ CreateDefaultRebarBarType(
	Document^ ADoc
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The newly created type id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace